# CreateLinkInstanceOnly Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCImportOptions..::..CreateLinkInstanceOnly Property
IFCImportOptions Class See Also
---
Determines whether to create a linked symbol element or not.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool CreateLinkInstanceOnly { get; set; }
```

Visual Basic
---
```text
Public Property CreateLinkInstanceOnly As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool CreateLinkInstanceOnly {
	bool get ();
	void set (bool value);
}
```

# Remarks
If this value is false (default), we will create a linked symbol and instance. If this value is true, then we will re-use an existing linked symbol file and create an instance only. The intention is for CreateLinkInstanceOnly to be true when we are trying to create a new link, when the link already exists in the host file.
# See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace